{
  "title": "Калинин Данил",
  "header": [
    {"href": "/", "text":  "Главная"},
    {"href": "/carier", "text":  "Карьера"},
    {"href": "/projects", "text":  "Pet-проекты"}
  ],
  "pages": {
    "index": {
      "description": "Портфолио - Калинин Данил Евгеньевич | Скилы, Проекты и Карьера",
      "greeting": "👋 Привет, давай знакомиться",
      "introduction": "Меня зовут Данил, и мне 19 лет. С 12 лет я интересуюсь программированием и разными науками. С детства меня привлекала техника, и я всегда находил удовольствие в изучении разных приборов и создании чего-то нового.",
      "current_education": "На данный момент работаю в game dev и параллельно занимаюсь как Личными так Freelance проектами. Активно стремлюсь к развитию своих профессиональных навыков. Я владею ООП и MVC (ModelViewController), имею опыт работы с Laravel и Symfony.",
      "programming_skills": "Изучал машинное обучение и реализовывал распознавание лиц и объектов на Python. У меня есть опыт в создании простых ботов для ВКонтакте (обработка фотографий, связка Python и PHP). Многие личные проекты под моим руководством включают в себя игры, чат-боты, онлайн-магазины и хостинг.",
      "skills_title": "Навыки в программировании",
      "skills": [
        "PHP",
        "Python",
        "JavaScript",
        "TypeScript",
        "Vue",
        "React",
        "Java (Kotlin)",
        "C# (ASP.Net)"
      ],
      "additional_info": "Также работал с MySQL, PostgreSQL, и REST API. Благодаря моему пониманию принципов функционирования браузеров и протоколов, я обладаю навыками работы с telnet и различными средами разработки. Умею тестировать API системы и разрабатывать свои, понимаю принципы работы сетей и работы с системами контроля версий, такими как Git.",
      "additional_info2": "Меня всегда привлекали математика и физика в школе и колледже. Я с удовольствием участвую в инженерных проектах, способный создавать программные решения и собирать электронные схемы."
    },
    "carier": {
      "bodyTitle": "Карьера",
      "description": "Узнайте больше о моем профессиональном пути, заметках карьерного роста и уникальных навыках. Во время моей карьеры, я работал на различных позициях в ведущих компаниях, получив ценный опыт и навыки, которые делимся на данной странице.",
      "content": [
        {
          "title": "Комитет",
          "img": "/images/vc.png",
          "link": "cmtt.ru",
          "text": "В рамках работы в компании \"Комитет\" я участвовал в проектах vc.ru и dtf.ru - престижных информационных новостных порталов, предлагающих актуальные новости и интересный контент своим читателям. В 2021 году моя деятельность в CMTT.RU была основана на улучшении пользовательского опыта: я занимался оперативными исправлениями старых багов, проводил успешные миграции баз данных, а также разрабатывал и внедрял новые функциональности для улучшения работы сайтов. Моя работа способствовала повышению качества сервиса и удовлетворенности пользователей, поддерживая высокую планку профессионализма и инноваций в проектах \"vc.ru\" и \"dtf.ru\" вместе с командой \"Комитет\".",
          "dates": "2021 - 2022",
          "stacks": [
            {"tag": "js", "text": "JavaScript"},
            {"tag": "php", "text": "PHP"}
          ]
        },
        {
          "title": "CryptoPirates",
          "img": "/images/cryptopirates.jpg",
          "link": "Crypto-Pirates.app",
          "text": "В рамках проекта CryptoPirates я занимал ключевую роль в разработке Backend'а на языке PHP, создании и оптимизации функционала личного кабинета, а также интеграции платежной системы Xsolla для удобстваа игроков. Моя работа также включала в себя настройку безопасной системы оплаты через банковские карты, обеспечивая надежность и удобство для всех участников проекта CryptoPirates. Моя цель заключалась в создании надежного и эффективного технического фундамента, который помогал проекту процветать в мире криптовалют и пиратства!",
          "dates": "2022 - 2023",
          "stacks": [
            {"tag": "js", "text": "JavaScript"},
            {"tag": "php", "text": "PHP"},
            {"tag": "nextjs", "text": "NextJS"}
          ]
        },
        {
          "title": "Botva.ru",
          "img": "/images/botva.jpeg",
          "link": "Botva.ru",
          "text": "С 2023 года, в рамках проекта \"Ботва\" я привношу креативность и профессионализм, занимаясь разработкой захватывающих ивентов, переписыванием наследственного кода для оптимизации процессов. Моей задачей является поиск эффективных решений для сложных технических задач, что позволяет проекту \"Ботва\" продолжать развиваться и совершенствоваться. Амбициозно двигаясь вперед, я стремлюсь к созданию уникального игрового опыта для наших пользователей и красивого будущего для проекта!",
          "dates": "2023",
          "stacks": [
            {"tag": "js", "text": "JavaScript"},
            {"tag": "php", "text": "PHP"},
            {"tag": "vue", "text": "Vue"}
          ]
        }
      ]
    },
    "projects": {
      "bodyTitle": "Личные проекты",
      "description": "Мои личные и заказные прокеты, здесь представлены мои лучшие проекты.",
      "content": [
        {
          "title": "BloodyAssistant",
          "body": "Голосовой ассистент для управления умным домом, для управления есть удобная веб панель управления и android приложение",
          "stacks": [
            {"tag": "vue", "text": "Vue"},
            {"tag": "js", "text": "JavaScript"},
            {"tag": "php", "text": "PHP"},
            {"tag": "flutter", "text": "Flutter"}
          ]
        },
        {
          "title": "VDSpace",
          "body": "Сервис аренды виртуальных серверов для малого бизнеса, хостинг сайтов и регистратор доменов",
          "img": "/images/projects/vdspace.png",
          "img_mini": "/images/projects/vdspace-mini.png",
          "stacks": [
            {"tag": "php", "text": "PHP"},
            {"tag": "vue", "text": "Vue"},
            {"tag": "js", "text": "JavaScript"}
          ]
        },
        {
          "title": "ZendorBot",
          "body": "Простой игровой бот для ВК, изучал возможности PHP и NodeJS",
          "img": "/images/projects/zendorbot.png",
          "img_mini": "/images/projects/zendorbot-mini.png",
          "stacks": [
            {"tag": "php", "text": "PHP"},
            {"tag": "js", "text": "JavaScript"}
          ]
        }
      ]
    }
  }
}